---
kind: type
id: T:Autodesk.Revit.DB.TableCellStyleOverrideOptions
source: html/ac17323d-f5cf-8a72-34e0-4632173daf52.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions

This helper class represents the overridden characteristics of the associated cell.

## Syntax (C#)
```csharp
public class TableCellStyleOverrideOptions : IDisposable
```

## Remarks
The user can override the text appearance and cell graphic properties by setting the corresponding flag to true.
 The global base format will control the non-overridden characteristics.